{
    "Keys": "Values_de",
    "about-me-title": "Über mich",
    "about-me-text": "Mit 17 Jahren Erfahrung in der Softwareentwicklungsbranche entwickle ich mit Leidenschaft innovative Lösungen, die die Technologie vorantreiben. Mein Werdegang hat mir ein fundiertes Wissen in einer Vielzahl von Technologien verschafft, darunter C, C++, Go, Python und Swift, mit einer Spezialisierung auf eingebettete Systeme und den Netzwerkbereich. Ich arbeite gerne in kollaborativen Umgebungen und nutze Best Practices, um die Leistung zu optimieren und das Benutzererlebnis in der Automobil- und Telekommunikationsbranche zu verbessern. Meine Arbeit ist geprägt von Qualitätsbewusstsein und der Leidenschaft für kontinuierliches Lernen. Ich bin stets bestrebt, sauberen, wartbaren Code zu schreiben. Ich bin begeistert von der technologischen Zukunft und freue mich auf neue Herausforderungen, bei denen ich mein Fachwissen und meine Leidenschaft einbringen kann.",
    "index-title": "Index",
    "index-about": "Über mich",
    "index-experience": "Erfahrung",
    "index-tools": "Technologie-Stack",
    "index-contact": "Kontakt",
    "resume-title": "Meinen Lebenslauf herunterladen",
    "tools-title": "Technologie-Stack",
    "experience-title": "Projekte",
    "exp-ai-auto-title": "Berater für KI-Automatisierung",
    "exp-ai-auto-summary": "Bereitstellung vollständiger KI-Automatisierungslösungen mit n8n. Integration der KI-Automatisierung in die vorhandenen Websites und Arbeitsabläufe.",
    "exp-gastro-title": "Produktinhaber",
    "exp-gastro-summary": "Für die GastroSmart GmbH wurde eine komplette Modernisierung der SaaS-Plattform durchgeführt. Das bestehende Catering-Management-System wurde in eine skalierbare NextJS/NestJS-Lösung umgewandelt, die die Leistung verbesserte und die Betriebskosten senkte. Die komplette Neuentwicklung wurde geleitet, ohne dass es während der Kundenumstellung zu Serviceunterbrechungen kam.",
    "exp-cnc-title": "Unternehmer | Product Owner & IoT Solution Engineer",
    "exp-cnc-summary": "Konzipiert und entwickelt eine innovative, mit der IoT-Cloud verbundene CNC-Fertigungslösung vom Konzept bis zum MVP in 4 Monaten und erstellt ein komplettes Produktökosystem einschließlich Hardware (tragbare 3-Achsen-CNC-Maschine), SaaS-Plattform und Abonnement-Geschäftsmodell, das die Herstellungskosten senkt.",
    "exp-adas-sme-title": "ADAS-Fachexperte (SME)",
    "exp-adas-sme-summary": "Ich war für die Bereitstellung der technischen Architektur und Produktentwicklung für mehrere ADAS-Funktionen der Stufen 1–2 für die Automobilplattform von Qualcomm verantwortlich.",
    "exp-adas-aspice-title": "ADAS ASPICE SYS-5 Verifizierung und Validierung.",
    "exp-adas-aspice-summary": "Erstellte eine umfassende Teststrategie für die ADAS-Funktionen der Stufe 1 und 2 von Qualcomm gemäß dem ASPICE SYS-5 Requirements V&V-Modell.",
    "exp-bmw-cv-title": "Computer Vision Engineer",
    "exp-bmw-cv-place-duration": "KPIT GmbH | München, Deutschland | Juni 2019 – Februar 2020",
    "exp-bmw-cv-summary": "Bereitstellung eines C++-Validierungsframeworks für die Kamerasysteme der autonom fahrenden Fahrzeuge von BMW, Festlegung objektiver Leistungsmetriken und Visualisierungstools für die Integration der Mobileye-Kamera in den Einsatz autonomer Fahrzeuge.",
    "exp-anova-title": "Netzwerk- und Datenanalyseingenieur",
    "exp-anova-place-duration": "Anova Data (Movik Networks) | Bengaluru, Indien | Februar 2017 – Mai 2019",
    "exp-anova-summary": "Entwicklung hochgradig skalierbarer Analysetools und -software mit C++/DPDK für Telekommunikationsdienstleister. Diese helfen den Dienstanbietern, Anomalien in ihrer Telekommunikationsnetzwerkinfrastruktur zu identifizieren.",
    "exp-moto-title": "Senior Software Engineer",
    "exp-moto-place-duration": "Arris (Motorola) | Bengaluru, Indien | Juni 2011 – Januar 2017",
    "exp-moto-summary": "Entwickelte wichtige Softwarekomponenten für Set-Top-Boxen und Kabelmodems und entwarf innovative Videoaufzeichnungssysteme und Digital Rights Management-Lösungen, die das Benutzererlebnis und die Inhaltssicherheit verbesserten.",
    "exp-mt-title": "Senior Software Engineer",
    "exp-mt-place-duration": "MindTree Ltd | Bengaluru, Indien | September 2008 – Juni 2011",
    "exp-mt-summary": "Leitete die Implementierung des Conax Conditional Access Systems für die Set-Top-Box-Plattform von DishTV und lieferte kritische Sicherheitskomponenten, die Premium-Inhalte schützten und durch einen strengen Zertifizierungsprozess ein abonnementbasiertes Geschäftsmodell ermöglichten.",
    "exp-read-more-link": "Mehr lesen",
    "exp-details-ai-auto-title": "Berater für KI-Automatisierung",
    "exp-ai-auto-place-duration": "Freiberuflich | Düsseldorf, Deutschland | März 2025 - Juni 2025",
    "exp-details-gastro-title": "Produktinhaber",
    "exp-gastro-place-duration": "Freiberuflich | Düsseldorf, Deutschland | Nov. 2024 - April 2025",
    "exp-details-gastro-clients": "Gastrosmart GmbH",
    "exp-details-gastro-text": "Für die GastroSmart GmbH wurde eine komplette Modernisierung der SaaS-Plattform durchgeführt. Das bestehende Catering-Management-System wurde in eine skalierbare NextJS/NestJS-Lösung umgewandelt, die die Leistung verbesserte und die Betriebskosten senkte. Die komplette Neuentwicklung wurde geleitet, ohne dass es während der Kundenumstellung zu Serviceunterbrechungen kam.",
    "exp-details-gastro-text-point-1": "Umfassende Kundengewinnung mit Stakeholder-Interviews durchgeführt, um Schwachstellen zu identifizieren und eine Produkt-Roadmap zu entwickeln.",
    "exp-details-gastro-text-point-2": "Erstellt und optimiert den Produkt-Backlog mit priorisierten User Stories und übersetzt Geschäftsanforderungen in umsetzbare Entwicklungsaufgaben.",
    "exp-details-gastro-text-point-3": "Leitete ein funktionsübergreifendes Team aus Frontend- und Backend-Entwicklern, gab strategische Anweisungen und beseitigte gleichzeitig Hindernisse.",
    "exp-details-gastro-text-point-4": "Erstellte eine umfassende Dokumentation der Schnittstellen unter Verwendung der OpenAPI-Spezifikation.",
    "exp-details-gastro-text-point-5": "Einführung der agilen Kanban-Methodik und Etablierung von Arbeitsabläufen und Zeremonien, die die Teamproduktivität um 30 % steigerten",
    "exp-details-gastro-text-point-6": "Entwicklung einer Datenmigrationsstrategie, die historische Daten bewahrt und gleichzeitig neue Systemfunktionen ohne Dienstunterbrechung ermöglicht.",
    "exp-details-gastro-text-point-7": "Managed Stakeholder-Erwartungen durch regelmäßige Demos und Fortschrittsaktualisierungen, um die Übereinstimmung zwischen der Vision des Kunden und dem gelieferten Produkt sicherzustellen.",
    "exp-details-gastro-techstack": "Technologie-Stack",
    "exp-details-gastro-techstack-point-1": "Go, NextJS, NestJS, Azure Cloud, GCP-Workflows, Prisma ORM, Node.js, Typescript, Javascript, React, REST-API, OAuth2, OWASP, Redis, PostgreSQL, PGAdmin, Elixir, Phoenix, CI/CD, Linux, Curl, Nu-Shell, Bash, Scripting GitHub, Linux, DevOps",
    "exp-details-gastro-techstack-point-2": "GitHub, Azure CI-CD, Azure-PostgresSQL, Azure-Redis, SCRUM, Agile Methoden, DevOps, Docker",
    "exp-details-cnc-title": "Unternehmer | Product Owner & IoT Solution Engineer",
    "exp-cnc-place-duration": "Freiberuflich | Bengaluru, Indien | Juni 2024 – Nov. 2024",
    "exp-details-cnc-clients": "Techkünstler",
    "exp-details-cnc-text": "Konzipiert und entwickelt eine innovative, mit der IoT-Cloud verbundene CNC-Fertigungslösung vom Konzept bis zum MVP in 4 Monaten und erstellt ein komplettes Produktökosystem einschließlich Hardware (tragbare 3-Achsen-CNC-Maschine), SaaS-Plattform und Abonnement-Geschäftsmodell, das die Herstellungskosten senkt.",
    "exp-details-cnc-text-point-1": "Durchgeführte Marktforschung zur Analyse der Angebote und Preispunkte der Konkurrenz, um die Produktpositionierung in unterversorgten CNC-Fertigungssegmenten zu definieren.",
    "exp-details-cnc-text-point-2": "Anforderungen direkt von Kunden erfasst und eine umfassende Produkt-Roadmap erstellt.",
    "exp-details-cnc-text-point-3": "Entwickelte Produkt-Roadmap mit klaren MVP-Meilensteinen für Hardware- und Softwarekomponenten.",
    "exp-details-cnc-text-point-4": "Konzipiert für die Entwicklung des gesamten Produktlebenszyklus von der Ideenfindung über die Entwicklung bis hin zur Markteinführung.",
    "exp-details-cnc-text-point-5": "Etablierte Preisstrategie und Abonnementmodell im Einklang mit den Markterwartungen.",
    "exp-details-cnc-text-point-6": "Aufbau einer vollständigen SaaS-Plattform mit Zahlungsintegration unter Verwendung von Microsoft Azure, die ein abonnementbasiertes Umsatzmodell ermöglicht",
    "exp-details-cnc-techstack": "Technologie-Stack",
    "exp-details-cnc-techstack-point-1": "C++, STM32, ESP32, BLE Low Energy, Motortreiber, FluidNC, Gdb, llvm, Debugging, TDD, Bash, Yaml, grbl, G-Code, AutoCAD, AutoCAD-API, VB-Scripting, Linux, ESP-Now, UART, Hardware-Debugging, STLINK JTAG, Core-Dump-Analyse",
    "exp-details-cnc-techstack-point-2": "Web: Go-lang, Python, Azure Cloud, IoT, Grafana, Node.js, React, REST-API, OAuth2, PostgreSQL, RazorPay-API, OpenAPI, CI/CD, GitHub, Linux, DevOps, Docker",
    "exp-details-ai-auto-text": "Bereitstellung vollständiger KI-Automatisierungslösungen mit n8n. Integration der KI-Automatisierung in die vorhandenen Websites und Arbeitsabläufe.",
    "exp-details-ai-auto-text-point-1": "Integrieren Sie die KI in die bestehenden Websites und automatisieren Sie den Verkaufstrichter.",
    "exp-details-ai-auto-text-point-2": "Umfassende Workflow-Automatisierung mit n8n durchgeführt.",
    "exp-details-ai-auto-text-point-3": "Erstellen Sie mithilfe eines Cold-E-Mail-Ansatzes einen Verkaufstrichter und senden Sie den Vertriebsteams in Slack-Kanälen dynamische Benachrichtigungen über potenzielle Kunden.",
    "exp-details-ai-auto-text-point-4": "Erstellen Sie benutzerdefinierte RAG-Systeme, um Kundenanfragen in Form von KI-Chatbots zu beantworten.",
    "exp-details-ai-auto-text-point-5": "Erstellen Sie Folge-Workflows und Tracking-Mechanismen, um den ROI des Vertriebs zu verbessern.",
    "exp-details-ai-auto-text-point-6": "Führen Sie Marktforschung zu den besten verfügbaren Modellen zur Lösung des spezifischen Problems durch und beraten Sie Kunden zu besseren und kostengünstigeren Alternativen.",
    "exp-details-ai-auto-text-point-7": "Integrieren Sie verschiedene KI-Anbieter in das System und bewerten Sie die Leistung der Modelle für eine bestimmte Aufgabe mithilfe benutzerdefinierter KPIs.",
    "exp-details-ai-auto-techstack": "Technologie-Stack",
    "exp-details-ai-auto-techstack-point-1": "RAG, MCP, Agentic AI, n8n, Vapi, OpenAI, Claude, Gemini, Ollama, Huggingfaces, Python, Langchain, Langfuse, Pydantic AI, Crawl4AI, Smolagents",
    "exp-details-ai-auto-techstack-point-2": "Azure AI-Integrationen, MLOps, DVC, benutzerdefinierte LLMs, Prompt Engineering.",
    "exp-details-ai-auto-techstack-point-3": "GitHub, Jenkins, CI-CD, Jira, SCRUM, Agile Methoden, DevOps, Docker",
    "exp-details-adas-sme-title": "ADAS-Fachexperte (SME).",
    "exp-sme-place-duration": "KPIT GmbH | München, Deutschland | Februar 2021 – Mai 2024",
    "exp-details-sme-clients": "Kunden: Qualcomm, Volvo, Polstar, BYD und Geely",
    "exp-details-sme-text": "Als Fachexperte war ich für die technische Architektur und Produktentwicklung mehrerer ADAS-Funktionen der Stufen 1 und 2 zuständig, darunter Highway Pilot Assist, Adaptive Cruise Control (ACC), Lane Change Assist (LCA), Automatic Emergency Braking (AEB) und Validierungsrahmen für die Automobilplattform von Qualcomm. Ich habe in diesem Projekt mehrere Rollen als Solution Architect, SCRUM Master und Product Owner übernommen.",
    "exp-details-sme-text-point-1": "Entwicklung und Wartung der Funktion „Highway Pilot Assist“, die die Spurzentrierung durch Straßengeometriefusion, Sensorfusion und Querführungssysteme ermöglicht",
    "exp-details-sme-text-point-2": "Implementierte fortschrittliche Algorithmen für die Pfadplanung und Bewegungsplanung in Szenarien des autonomen Fahrens",
    "exp-details-sme-text-point-3": "Entwicklung von Zustandsschätzungsmodellen und Kalman-Filterimplementierungen in C++ für Sensorfusion und Fahrzeugpositionierung",
    "exp-details-sme-text-point-4": "Verwalte den gesamten Produktlebenszyklus von der Anforderungserfassung bis hin zur Bereitstellung und Wartung für mehrere ADAS-Funktionen",
    "exp-details-sme-text-point-5": "Fungierte als primärer technischer Verbindungsmann zwischen den Ingenieuren von Qualcomm und den Interessenvertretern chinesischer OEMs",
    "exp-details-sme-text-point-6": "Leitung funktionsübergreifender Entwicklungsteams bei gleichzeitiger Implementierung strukturierter agiler Arbeitsabläufe und Qualitätstore",
    "exp-details-sme-text-point-7": "Erstellt umfassende Produktdokumentation und Wissensmanagementsysteme für ADAS-Funktionen.",
    "exp-details-sme-techstack": "Technologie-Stack",
    "exp-details-sme-techstack-point-1": "C, C++, Python, MATLAB, Simulink, m-script, Bash, Linux, QNX, AURIX",
    "exp-details-sme-techstack-point-2": "MISRAL, AUTOSAR, ADASIS v2, CAN, CAN-FD, OBD-2, LIN, SOME-IP, CANoe, dSPACE, FlexRay, Software Defined Vehicle (SDV), Hardware In the Loop (HIL), Model In the Loop (MIL), Software In the Loop (SIL), Fahrzeugtests, TDD, gTest, Unit-Tests.",
    "exp-details-sme-techstack-point-3": "Gerrit, GitHub, Zull, Jenkins, CI-CD, Jira, Codebeamer, Confluence, Artifactory, SCRUM, Agile Methoden, DevOps, Docker",
    "exp-details-adas-aspice-title": "Leiter Testautomatisierung | Produktinhaber",
    "exp-adas-aspice-place-duration": "KPIT GmbH | München, Deutschland | Februar 2020 - Februar 2021",
    "exp-details-aspice-clients": "Kunden: Qualcomm, Volvo, Polstar, BYD und Geely",
    "exp-details-aspice-text": "Leiten Sie als „Test Automation Lead“ ein Team von Testingenieuren für die ADAS-Funktionen. Leiten Sie die Testautomatisierung für die Automobilplattform von Qualcomm unter Einhaltung des APSICE SYS-2-, SYS-3- und SYS-5-Verifizierungs- und Validierungsspezifikationsmodells (V&V).",
    "exp-details-aspice-text-point-1": "100 %ige Anforderungsabdeckung für ADAS-Funktionen der Stufen 1 und 2 wie ACC, Verkehrsassistent und Spurwechselassistent erreicht",
    "exp-details-aspice-text-point-2": "Erstellte detaillierte Testpläne und Ausführungsmethoden.",
    "exp-details-aspice-text-point-3": "Mit dSPACE-Simulationen wurde für die komplexen ADAS-Anwendungsfälle eine Testabdeckung von 100 % erreicht.",
    "exp-details-aspice-text-point-4": "Verfasste ASPICE SYS.2-, SYS.3- und SYS.5-konforme Anforderungsüberprüfung und -validierung für ADAS-Funktionen",
    "exp-details-aspice-text-point-5": "Erfolgreiche Erreichung der EURO NCAP-Konformität für die mit dSPACE getesteten und validierten Funktionen.",
    "exp-details-aspice-text-point-6": "Leitung funktionsübergreifender Entwicklungsteams bei gleichzeitiger Implementierung strukturierter agiler Arbeitsabläufe und Qualitätstore",
    "exp-details-aspice-text-point-7": "Erstellte umfassende Produkttestdokumentation und Wissensmanagementsysteme für ADAS-Funktionen.",
    "exp-details-aspice-techstack": "Technologie-Stack",
    "exp-details-aspice-techstack-point-1": "C++, Python, MATLAB, Simulink, m-script, Bash, Linux, QNX, AURIX",
    "exp-details-aspice-techstack-point-2": "MISRAL, AUTOSAR, ADASIS v2, CAN, CAN-FD, OBD-2, LIN, SOME-IP, CANoe, dSPACE, FlexRay, Software Defined Vehicle (SDV), Hardware In the Loop (HIL), Model In the Loop (MIL), Software In the Loop (SIL), Fahrzeugtests, TDD, gTest, Unit-Tests.",
    "exp-details-aspice-techstack-point-3": "Black-Box-Tests, White-Box-Tests, Feldtests, Systemtests, Integrationstests, Regressionstests, E2E-Tests",
    "exp-details-aspice-techstack-point-4": "Gerrit, GitHub, Zull, Jenkins, CI-CD, Jira, Codebeamer, Confluence, Artifactory, SCRUM, Agile Methoden, DevOps, Docker",
    "exp-details-adas-bmw-cv-title": "Computer Vision Engineer",
    "exp-details-bmw-cv-clients": "Kunden: BMW und Mobileye",
    "exp-details-bmw-cv-text": "Entwicklung eines Validierungsrahmens für die autonomen Fahrkamerasysteme von BMW, der eine objektive Leistungsmessung ermöglicht",
    "exp-details-bmw-cv-text-point-1": "Entwicklung von Computer-Vision-Algorithmen zur Fahrspurerkennung und Validierung der Verkehrszeichenerkennung mithilfe von OpenCV-Bibliotheken.",
    "exp-details-bmw-cv-text-point-2": "Erstellung von Visualisierungstools und Dashboards zur Leistungsanalyse von Kamerasystemen und zur Fehleridentifizierung",
    "exp-details-bmw-cv-text-point-3": "Festgelegte quantifizierbare KPIs zur objektiven Messung der Leistung von Kamerasystemen und der Verantwortlichkeit des Anbieters.",
    "exp-details-bmw-cv-text-point-4": "Diente als primäre technische Schnittstelle zwischen den Vision-Spezialisten von BMW und den Entwicklungsteams",
    "exp-details-bmw-cv-text-point-5": "Verwaltete Priorisierung des Produkt-Backlogs und Sprint-Planung für die rechtzeitige Bereitstellung von Validierungsfunktionen.",
    "exp-details-bmw-cv-text-point-6": "Angeleitete Drittanbieter von Datenannotationen zur Verbesserung der Qualität von Ground-Truth-Daten durch detaillierte Spezifikationen.",
    "exp-details-bmw-cv-techstack": "Technologie-Stack",
    "exp-details-bmw-cv-techstack-point-1": "C++, OpenCV, OpenGL, Python, Bash, Linux",
    "exp-details-bmw-cv-techstack-point-2": "CMake, Bazel, TDD, gTest, Mocks, GDB, CoreDump-Analyse, AUTOSAR, Bildverarbeitungsalgorithmen, Computer Vision, Ground-Truth-Datenannotation, maschinelles Lernen.",
    "exp-details-bmw-cv-techstack-point-3": "GitHub, CI-CD, Jira, Confluence, Artifactory, SCRUM im großen Maßstab, Agile Methoden, DevOps, Docker",
    "exp-details-anova-title": "Netzwerk- und Datenanalyseingenieur",
    "exp-details-anova-clients": "Kunden: British Telecom, AT&T und Bharathi Airtel",
    "exp-details-anova-text": "Konzipiert und entwickelt von Grund auf eine innovative Netzwerküberwachungsplattform, die durch maschinelle Lernanalysen und Echtzeit-Netzwerkdiagnosen Einblicke in die Leistung der Telekommunikationsinfrastruktur für große Telekommunikationsbetreiber wie British Telecom, AT&T und Bharthi Airtel ermöglicht.",
    "exp-details-anova-text-point-1": "Entwicklung einer zentralen Analyse-Engine mit C++/DPDK.",
    "exp-details-anova-text-point-2": "Entwicklung von Machine-Learning-Modellen (ML) mit Python und Scikit-Learn zur Erkennung von Netzwerkanomalien und zur Fehlervorhersage",
    "exp-details-anova-text-point-3": "Entwickelte und implementierte Netzwerk-KPIs zur Quantifizierung der Dienstqualität, Signalintegrität und kritischer Telekommunikationsmetriken",
    "exp-details-anova-text-point-4": "Erstellen Sie Visualisierungs-Dashboards, die komplexe Netzwerkdaten in umsetzbare Erkenntnisse für Betriebsteams umwandeln",
    "exp-details-anova-text-point-5": "Erstellung von Tools zur Automatisierung der Bereitstellung, die Produktaktualisierungen in allen Rechenzentren der Kunden optimieren",
    "exp-details-anova-text-point-6": "Betreuung von Ingenieurteams bei Telekommunikationsprotokollen und Best Practices zur Implementierung von maschinellem Lernen",
    "exp-details-anova-techstack": "Technologie-Stack",
    "exp-details-anova-techstack-point-1": "C++, Python, DPDK, LLVM, Pandas, Scikit-learn, Matplotlib, Bash, Linux, Perl",
    "exp-details-anova-techstack-point-2": "Zookeeper, Kafka, Cassandra, DevOps, Docker, Kubernetes.",
    "exp-details-anova-techstack-point-3": "ClearCase, Jenkins, CI-CD, Jira, Grafana, Maschinelles Lernen, SCRUM, Agile Methoden, DevOps, Docker",
    "exp-details-moto-title": "Senior Software Engineer",
    "exp-details-moto-clients": "Kunden: Verizon und Commcast",
    "exp-details-moto-text": "Entwurf und Entwicklung eines Digital Rights Management (DRM)-Systems, das die Sicherheitsanforderungen von ISO-27001 erfüllt.",
    "exp-details-moto-text-point-1": "Entwicklung eines Videoaufzeichnungs- und Speicherverwaltungssystems mit Einführung einer Pause-und-Wiedergabe-Funktion für ein verbessertes Benutzererlebnis.",
    "exp-details-moto-text-point-2": "Entwickelte Software-Defined Networking-Funktionen für Kabelmodems der nächsten Generation, die erweiterte Kindersicherungen und Bandbreitenverwaltung ermöglichen",
    "exp-details-moto-text-point-3": "Implementierte Bandbreitendrosselungsfunktionen ermöglichen die Priorisierung kritischer Anwendungen bei Netzwerküberlastung",
    "exp-details-moto-text-point-4": "Optimierte Medienspeicherverwaltung über begrenzte Hardwareressourcen für eine effiziente Inhaltsverwaltung",
    "exp-details-moto-techstack": "Technologie-Stack",
    "exp-details-moto-techstack-point-1": "C++, Python, RDK-V, RDK-B, LLVM, Pandas, Scikit-learn, Matplotlib, Bash, Javascript, Linux, Perl",
    "exp-details-moto-techstack-point-2": "SVN, Jenkins, CI-CD, Make, CMake, Yocto, SCRUM, Agile Methoden",
    "exp-details-mt-title": "Senior Software Engineer",
    "exp-details-mt-clients": "Kunden: DishTV",
    "exp-details-mt-text": "Leitete die Implementierung des Conax Conditional Access Systems für die Set-Top-Box-Plattform von DishTV und lieferte kritische Sicherheitskomponenten, die Premium-Inhalte schützten und durch einen strengen Zertifizierungsprozess ein abonnementbasiertes Geschäftsmodell ermöglichten.",
    "exp-details-mt-text-point-1": "Entwurf und Entwicklung eines Conditional Access-Systems zur Sicherung der Inhaltsbereitstellung und Gewährleistung eines nahtlosen Seherlebnisses",
    "exp-details-mt-text-point-2": "Implementierte Smartcard-Integration, die legitime Abonnenten authentifiziert und gleichzeitig unbefugten Zugriff verhindert",
    "exp-details-mt-text-point-3": "Eingebaute sichere Bootloader und Verschlüsselungssysteme zum Schutz vor hardwarebasierten Sicherheitsangriffen",
    "exp-details-mt-text-point-4": "Durchlaufen des strengen Conax-Zertifizierungsprozesses, um die Einhaltung internationaler Sicherheitsstandards sicherzustellen",
    "exp-details-mt-techstack": "Technologie-Stack",
    "exp-details-mt-techstack-point-1": "C, Bash, Linux, eingebettete Systeme, Conax bedingter Zugriff, Bootloader, sicherer Start, Smartcard",
    "exp-details-mt-techstack-point-2": "Svn, Jenkins, CI-CD, Make",
    "back-to-exp-link": "Zurück zu Projekte",
    "contact-title": "Kontaktiere mich",
    "contact-label-name": "Ihr Name",
    "contact-label-email": "Ihre E-Mail-ID",
    "contact-label-type": "Ich bin ein...",
    "contact-option-recruiter": "Personalvermittler",
    "contact-option-consultant": "Berater",
    "contact-option-firm": "Firma",
    "contact-option-other": "Andere",
    "contact-label-message": "Ihre Nachricht",
    "contact-submit-button": "Nachricht senden",
    "footer-text": "© 2025 Santhosh K S. Alle Rechte vorbehalten."
}